# GetDocument Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionChangedEventArgs..::..GetDocument Method
SelectionChangedEventArgs Class See Also
---
Returns the document associated with this event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace